;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! ggtags)
(package! projectile-ripgrep)
(package! deadgrep)
(package! fzf)
(package! frog-jump-buffer)
(package! company-try-hard)
(package! shell-pop)
(package! quickrun)

(package! elsa)
(package! flycheck-elsa)
(package! flycheck-package)
(package! package-lint)
(package! ox-hugo)
(package! dired-git-info)
(package! source-peek :recipe (:host github :repo "iqbalansari/emacs-source-peek"))

(package! corral)
(package! key-chord)
(package! parrot)
(package! double-saber)

